demo/f16/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices ( (-30 -30 -30) (60 -30 -30) (60 30 -30) (-30 30 -30) (-30 -30 30) (60 -30 30) (60 30 30) (-30 30 30) );
blocks ( hex (0 1 2 3 4 5 6 7) (60 40 40) simpleGrading (1 1 1) );
edges ();
boundary
(
    inlet    { type patch; faces ((0 4 7 3)); }
    outlet   { type patch; faces ((1 2 6 5)); }
    farfield { type patch; faces ((0 1 5 4)(3 7 6 2)(4 5 6 7)(0 3 2 1)); }
);
